In [1]:
# float
num = 10.2
n = 11.9928


#int
a = 10
b = 19928

In [1]:
import numpy as np

In [11]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [22]:
for i in range(0,10):
    print(i, end=' ')

0 1 2 3 4 5 6 7 8 9

In [13]:
for i in range(2,10,2):
    print(i, end=' ')

2 4 6 8

In [14]:
arr = np.arange(10)

In [16]:
type(arr)

numpy.ndarray

In [18]:
arr.shape

(10,)

In [19]:
arr

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [20]:
arr.dtype

dtype('int64')

In [23]:
arr = np.arange(100)

In [25]:
arr.reshape(10,10)

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [26]:
lst1 = [1,2,3,4,5]
lst2 = [6,7,8,9,0]

In [27]:
a = np.array([lst1, lst2])

In [28]:
a

array([[1, 2, 3, 4, 5],
       [6, 7, 8, 9, 0]])

In [32]:
np.ones(10).reshape(2,5)

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [33]:
np.zeros(10).reshape(2,5)

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [42]:
np.random.randint(10,140)

84

In [44]:
np.linspace(0, 20, 7)

array([ 0.        ,  3.33333333,  6.66666667, 10.        , 13.33333333,
       16.66666667, 20.        ])

In [45]:
a

array([[1, 2, 3, 4, 5],
       [6, 7, 8, 9, 0]])

In [46]:
a.sum()

45

In [47]:
np.mean(a)

4.5

In [48]:
np.mean(a, axis=0)

array([3.5, 4.5, 5.5, 6.5, 2.5])

In [70]:
a = np.random.random(20) * 100

In [74]:
a

array([19.11412557, 53.07315125, 35.58123116, 71.03027241, 70.39249091,
       94.93749302, 16.93298604, 97.47011919, 94.76996935, 81.80542091,
       28.77879493,  9.72116978, 29.66912512, 23.82171676, 23.53617276,
       15.56251212, 27.98351978, 69.94650454,  5.57693955, 14.49106335])

In [78]:
a[0:2]

array([19.11412557, 53.07315125])

In [79]:
a.reshape(5,4)

array([[19.11412557, 53.07315125, 35.58123116, 71.03027241],
       [70.39249091, 94.93749302, 16.93298604, 97.47011919],
       [94.76996935, 81.80542091, 28.77879493,  9.72116978],
       [29.66912512, 23.82171676, 23.53617276, 15.56251212],
       [27.98351978, 69.94650454,  5.57693955, 14.49106335]])

In [80]:
a[0:2, 0:4]

IndexError: too many indices for array

In [81]:
a = np.arange(100).reshape(10,10)

In [82]:
a

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [87]:
a[2:6, 1:7]

array([[21, 22, 23, 24, 25, 26],
       [31, 32, 33, 34, 35, 36],
       [41, 42, 43, 44, 45, 46],
       [51, 52, 53, 54, 55, 56]])

In [86]:
a[1:3]

array([[10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29]])

In [84]:
# slicing multidimentsional array
# [ start: stop: step , start: stop: step ]
a[1:3, 3:7]

array([[13, 14, 15, 16],
       [23, 24, 25, 26]])

In [69]:
a.reshape(5,4)

array([[59.97174128, 70.09035441, 66.28593161, 10.60576436],
       [ 1.68242981, 54.5077477 ,  4.21810297, 12.55762151],
       [21.76011041, 35.48736309, 62.51885068, 88.41627133],
       [53.20146636, 79.16008445, 76.96256061,  9.21295884],
       [89.50829407, 31.79390121, 58.104292  , 97.85227987]])

In [72]:
b = np.random.randint(10,140)

In [73]:
b

68

In [57]:
a[1:4]

array([49.62826761, 93.69413395, 39.97836002])

In [58]:
lst = [2,4,6,7,8,9]

In [60]:
lst[3]

7

In [61]:
lst[1:3]

[4, 6]

In [2]:
a = np.random.random(20) * 100

In [3]:
a

array([34.9723063 , 18.19724937, 77.29199163, 80.51770736, 85.52601728,
       42.2501273 , 35.67796753, 95.04513594,  3.56759457, 72.47164533,
       62.56787438, 84.32027278, 51.93569918, 13.67613233, 10.1538805 ,
       15.85607923, 47.40355365, 64.79573389, 78.45447759, 65.99223239])

In [6]:
a[7:19]

array([95.04513594,  3.56759457, 72.47164533, 62.56787438, 84.32027278,
       51.93569918, 13.67613233, 10.1538805 , 15.85607923, 47.40355365,
       64.79573389, 78.45447759])

In [8]:
greater_than_50 = a[a>50]

In [9]:
type(greater_than_50)

numpy.ndarray

In [10]:
greater_than_50

array([77.29199163, 80.51770736, 85.52601728, 95.04513594, 72.47164533,
       62.56787438, 84.32027278, 51.93569918, 64.79573389, 78.45447759,
       65.99223239])

In [12]:
arr2 = a[(a>50) & (a<80)]

In [13]:
arr2

array([77.29199163, 72.47164533, 62.56787438, 51.93569918, 64.79573389,
       78.45447759, 65.99223239])

In [14]:
a[(a>50) | (a<10)]

array([77.29199163, 80.51770736, 85.52601728, 95.04513594,  3.56759457,
       72.47164533, 62.56787438, 84.32027278, 51.93569918, 64.79573389,
       78.45447759, 65.99223239])

In [16]:
lst1 = [ i for i in range(1000000) ]
lst2 = [ i for i in range(1000000) ]

In [21]:
import time

In [18]:
t1 = time.time()
result =

In [22]:
lst1 = [1,2,3]
lst2 = [7,8,9]
lst1+lst2

[1, 2, 3, 7, 8, 9]

In [25]:
# [8, 10, 12]

In [33]:
lst1 = [ i for i in range(1000000) ]
lst2 = [ i for i in range(1000000) ]
t1 = time.time()
result = [ x+y for x,y in zip(lst1,lst2) ]
print(result[:20])

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38]

In [36]:
lst1 = [ i for i in range(10000000) ]
lst2 = [ i for i in range(10000000) ]
t1 = time.time()
result = [ x+y for x,y in zip(lst1,lst2) ]
print('Time taken for adding two lists:', (time.time()-t1)*1000)

Time taken for adding two lists: 1628.749132156372

In [40]:
a1 = np.arange(10000000)
a2 = np.arange(10000000)
t1 = time.time()
result = a1 + a2
print('Time taken for adding two lists:', (time.time()-t1)*1000)

Time taken for adding two lists: 213.88816833496094

In [41]:
arr = np.array([23,34,56,57,78,56,34,23,2,23,34,45,67,78,12,23,34,45,56,67,68])

arr

In [42]:
arr

array([23, 34, 56, 57, 78, 56, 34, 23,  2, 23, 34, 45, 67, 78, 12, 23, 34,
       45, 56, 67, 68])

In [43]:
np.unique(arr)

array([ 2, 12, 23, 34, 45, 56, 57, 67, 68, 78])

In [45]:
arr.shape

(21,)

In [46]:
arr = np.array([23,34,56,57,78,56,34,23,2,23,34,45,67,78,12,23,34,45,56,67])

In [50]:
arr.shape

(20,)

In [47]:
import math

In [48]:
math.pi

3.141592653589793

In [49]:
np.pi

3.141592653589793

In [51]:
arr.reshape(4,5)

array([[23, 34, 56, 57, 78],
       [56, 34, 23,  2, 23],
       [34, 45, 67, 78, 12],
       [23, 34, 45, 56, 67]])

In [56]:
arr1 = np.array([23,34,56,57,78,56,34,23,2,23,34,45,67,78,12,23,34,45,56,67]).reshape(4,5)
arr2 = np.random.random(20)*100

In [57]:
arr1

array([[23, 34, 56, 57, 78],
       [56, 34, 23,  2, 23],
       [34, 45, 67, 78, 12],
       [23, 34, 45, 56, 67]])

In [59]:
arr2 = arr2.reshape(4,5)

In [60]:
arr2

array([[98.38115289, 94.09441247, 64.02103741, 71.77775992, 18.59164232],
       [70.93592108, 97.44229428, 86.93728346, 61.86809983, 40.20046025],
       [20.30473992, 86.51882494, 79.72102268, 91.12177593, 20.65539025],
       [37.25454375, 16.005485  , 96.38698629, 90.49605637, 38.87538015]])

In [62]:
np.hstack((arr1, arr2))

array([[23.        , 34.        , 56.        , 57.        , 78.        ,
        98.38115289, 94.09441247, 64.02103741, 71.77775992, 18.59164232],
       [56.        , 34.        , 23.        ,  2.        , 23.        ,
        70.93592108, 97.44229428, 86.93728346, 61.86809983, 40.20046025],
       [34.        , 45.        , 67.        , 78.        , 12.        ,
        20.30473992, 86.51882494, 79.72102268, 91.12177593, 20.65539025],
       [23.        , 34.        , 45.        , 56.        , 67.        ,
        37.25454375, 16.005485  , 96.38698629, 90.49605637, 38.87538015]])

In [64]:
new_arr = np.vstack((arr1, arr2))

In [65]:
new_arr.shape

(8, 5)

In [66]:
arr1.shape

(4, 5)

In [70]:
a1 = np.array([1,2,3,4]).reshape(2,2)
a2 = np.array([5,6,7,8]).reshape(2,2)
a1+a2

array([[ 6,  8],
       [10, 12]])

In [71]:
np.hstack((a1,a2))

array([[1, 2, 5, 6],
       [3, 4, 7, 8]])

In [74]:
arr = np.random.rand(4,5)

In [75]:
arr.mean()

0.5467550620148782

In [76]:
M0 = np.array([ [2,1], [1, 1] ])
M1 = np.array([1,2])

In [78]:
np.linalg.solve(M0, M1)

array([-1.,  3.])

In [81]:
# 2x + y = 1
# x + y = 2

2*(-1) + 3

1

In [83]:
import pandas as pd

In [84]:
months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
temperature = [35, 36, 38, 40, 44, 39, 32, 28, 27, 29, 31, 33]
s=pd.Series(index=months, data=temperature)

In [85]:
type(s)

pandas.core.series.Series

In [86]:
s

Jan    35
Feb    36
Mar    38
Apr    40
May    44
Jun    39
Jul    32
Aug    28
Sep    27
Oct    29
Nov    31
Dec    33
dtype: int64

In [89]:
data = { 'year': [2008, 2012, 2016], 'attendees': [112, 321, 729], 'avg_age': [24, 41, 29] }
df = pd.DataFrame(data)

In [90]:
df

   attendees  avg_age  year
0        112       24  2008
1        321       41  2012
2        729       29  2016

In [91]:
df['year']

0    2008
1    2012
2    2016
Name: year, dtype: int64

In [92]:
df['avg_age']

0    24
1    41
2    29
Name: avg_age, dtype: int64

In [93]:
df.shape

(3, 3)

In [94]:
df.size

9

In [95]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [98]:
data = df.values

In [99]:
type(data)

numpy.ndarray

In [100]:
data

array([[ 112,   24, 2008],
       [ 321,   41, 2012],
       [ 729,   29, 2016]])

In [101]:
df

   attendees  avg_age  year
0        112       24  2008
1        321       41  2012
2        729       29  2016

In [102]:
df.columns

Index(['attendees', 'avg_age', 'year'], dtype='object')

In [103]:
df.attendees

0    112
1    321
2    729
Name: attendees, dtype: int64

In [104]:
df['attendees']

0    112
1    321
2    729
Name: attendees, dtype: int64

In [105]:
df[['attendees', 'avg_age']]

   attendees  avg_age
0        112       24
1        321       41
2        729       29

In [106]:
df[['attendees', 'avg_age']].values

array([[112,  24],
       [321,  41],
       [729,  29]])

In [107]:
df

   attendees  avg_age  year
0        112       24  2008
1        321       41  2012
2        729       29  2016

In [108]:
df['city'] = 'New Delhi'

In [109]:
df

   attendees  avg_age  year       city
0        112       24  2008  New Delhi
1        321       41  2012  New Delhi
2        729       29  2016  New Delhi

In [110]:
df['year'] = df['year'] + 2

In [111]:
df

   attendees  avg_age  year       city
0        112       24  2010  New Delhi
1        321       41  2014  New Delhi
2        729       29  2018  New Delhi

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
attendees    3 non-null int64
avg_age      3 non-null int64
year         3 non-null int64
city         3 non-null object
dtypes: int64(3), object(1)
memory usage: 176.0+ bytes

In [113]:
df.describe()

        attendees    avg_age    year
count    3.000000   3.000000     3.0
mean   387.333333  31.333333  2014.0
std    313.803017   8.736895     4.0
min    112.000000  24.000000  2010.0
25%    216.500000  26.500000  2012.0
50%    321.000000  29.000000  2014.0
75%    525.000000  35.000000  2016.0
max    729.000000  41.000000  2018.0

In [199]:
data = pd.read_csv('/Users/Ganesh/Desktop/titanic.csv')

In [200]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [201]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [202]:
# data.Age
data['Age']
data[data['Age']>50].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C

In [204]:
data[data['Age'].between(40,50)].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 99 entries, 30 to 873
Data columns (total 12 columns):
PassengerId    99 non-null int64
Survived       99 non-null int64
Pclass         99 non-null int64
Name           99 non-null object
Sex            99 non-null object
Age            99 non-null float64
SibSp          99 non-null int64
Parch          99 non-null int64
Ticket         99 non-null object
Fare           99 non-null float64
Cabin          37 non-null object
Embarked       99 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 10.1+ KB

In [120]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [128]:
old_females = data[(data['Age']>50) & (data['Sex'] == 'female')]

In [129]:
old_females.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
268,269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,C125,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S

In [133]:
old_females.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17 entries, 11 to 879
Data columns (total 12 columns):
PassengerId    17 non-null int64
Survived       17 non-null int64
Pclass         17 non-null int64
Name           17 non-null object
Sex            17 non-null object
Age            17 non-null float64
SibSp          17 non-null int64
Parch          17 non-null int64
Ticket         17 non-null object
Fare           17 non-null float64
Cabin          13 non-null object
Embarked       16 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 1.7+ KB

In [134]:
import pandas as pd

In [144]:
old_females.to_csv('/Users/Ganesh/Desktop/titanic_females.csv', index_label='Row ID')

In [149]:
df = pd.read_excel('/Users/Ganesh/Desktop/Superstore.xls', index_label='Row ID')

WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero

In [150]:
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [155]:
df.loc[2:5]

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
2,3,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
5,6,CA-2015-115812,2015-06-09,2015-06-14,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,Los Angeles,...,90032.0,West,FUR-FU-10001487,Furniture,Furnishings,Eldon Expressions Wood and Plastic Desk Access...,48.8600,7,0.00,14.1694

In [156]:
df = pd.read_csv('/Users/Ganesh/Desktop/city_temp.csv')

In [160]:
df[df['city'] == 'Mumbai'].temp.mean()

34.0

In [161]:
t = df[df['city'] == 'Mumbai']
t['temp'].mean()

34.0

In [162]:
df

   day         city  temp
0    2  Mumbai_City    28
1    3         Pune    24
2    4      Mumbai     30
3    5  Mumbai_City    31
4    6         Pune    29
5    7       Mumbai    34
6    8       Mumbai    34
7    9         Pune    29

In [163]:
t

   day    city  temp
5    7  Mumbai    34
6    8  Mumbai    34

In [177]:
df['city'] = df['city'].str.upper()

In [178]:
df

   day         city  temp
0    2  MUMBAI_CITY    28
1    3         PUNE    24
2    4       MUMBAI    30
3    5  MUMBAI_CITY    31
4    6         PUNE    29
5    7       MUMBAI    34
6    8       MUMBAI    34
7    9         PUNE    29

In [181]:
t = df[df['city'] == 'MUMBAI']

In [182]:
t['temp'].mean()

32.666666666666664

In [183]:
df

   day         city  temp
0    2  MUMBAI_CITY    28
1    3         PUNE    24
2    4       MUMBAI    30
3    5  MUMBAI_CITY    31
4    6         PUNE    29
5    7       MUMBAI    34
6    8       MUMBAI    34
7    9         PUNE    29

In [191]:
df.sort_values(by='temp', ascending=False)

   day         city  temp
5    7       MUMBAI    34
6    8       MUMBAI    34
3    5  MUMBAI_CITY    31
2    4       MUMBAI    30
4    6         PUNE    29
7    9         PUNE    29
0    2  MUMBAI_CITY    28
1    3         PUNE    24

In [196]:
df.sort_values(by=['temp', 'day'], ascending=[False, True], inplace=True)

In [198]:
df[df['temp'].between(30, 34)]

   day         city  temp
5    7       MUMBAI    34
6    8       MUMBAI    34
3    5  MUMBAI_CITY    31
2    4       MUMBAI    30

In [206]:
df['city'].apply(len)

5     6
6     6
3    11
2     6
4     4
7     4
0    11
1     4
Name: city, dtype: int64

In [207]:
df

   day         city  temp
5    7       MUMBAI    34
6    8       MUMBAI    34
3    5  MUMBAI_CITY    31
2    4       MUMBAI    30
4    6         PUNE    29
7    9         PUNE    29
0    2  MUMBAI_CITY    28
1    3         PUNE    24

In [211]:
df.drop('day', axis=1, inplace=True)

In [213]:
df

          city  temp
5       MUMBAI    34
6       MUMBAI    34
3  MUMBAI_CITY    31
2       MUMBAI    30
4         PUNE    29
7         PUNE    29
0  MUMBAI_CITY    28
1         PUNE    24